#### Terraform Plan 
```
module.lambda_iam.data.aws_region.current: Reading...
module.iam.data.aws_caller_identity.current: Reading...
module.lambda_iam.data.aws_caller_identity.current: Reading...
module.ses.aws_ses_email_identity.sender: Refreshing state... [id=ontrak.technologies@gmail.com]
module.lambda_iam.aws_iam_role.lambda_backend: Refreshing state... [id=ot-muse-lambda-backend]
module.dynamodb.aws_dynamodb_table.auth: Refreshing state... [id=ot-muse-users]
module.lambda_iam.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_iam.aws_iam_policy.bedrock_access: Refreshing state... [id=arn:aws:iam::539272219375:policy/ot-muse-lambda-backend-bedrock]
module.iam.data.aws_caller_identity.current: Read complete after 0s [id=539272219375]
module.iam.aws_iam_role.amplify_ssr: Refreshing state... [id=ot-muse-amplify-ssr]
module.lambda_iam.data.aws_caller_identity.current: Read complete after 0s [id=539272219375]
module.lambda_iam.aws_iam_policy.cloudwatch_logs: Refreshing state... [id=arn:aws:iam::539272219375:policy/ot-muse-lambda-backend-logs]
module.lambda_iam.aws_iam_role_policy_attachment.bedrock: Refreshing state... [id=ot-muse-lambda-backend-20260225013951029500000002]
module.lambda_iam.aws_iam_role_policy_attachment.cloudwatch: Refreshing state... [id=ot-muse-lambda-backend-20260225013951039000000003]
module.lambda_iam.aws_iam_policy.dynamodb_access: Refreshing state... [id=arn:aws:iam::539272219375:policy/ot-muse-lambda-backend-dynamodb]
module.iam.aws_iam_policy.amplify_ssr: Refreshing state... [id=arn:aws:iam::539272219375:policy/ot-muse-amplify-ssr-policy]
module.iam.aws_iam_role_policy_attachment.amplify_ssr: Refreshing state... [id=ot-muse-amplify-ssr-20260218184633664000000001]
module.lambda_iam.aws_iam_role_policy_attachment.dynamodb: Refreshing state... [id=ot-muse-lambda-backend-20260225013951000000000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.lambda_iam.aws_iam_policy.s3_access will be created
  + resource "aws_iam_policy" "s3_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Scoped S3 access for generated assets"
      + id               = (known after apply)
      + name             = "ot-muse-lambda-backend-s3"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Component" = "backend"
        }
      + tags_all         = {
          + "Component"   = "backend"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ot-muse"
        }
    }

  # module.lambda_iam.aws_iam_role_policy_attachment.s3 will be created
  + resource "aws_iam_role_policy_attachment" "s3" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ot-muse-lambda-backend"
    }

  # module.s3.aws_s3_bucket.assets will be created
  + resource "aws_s3_bucket" "assets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "ot-muse-assets"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Component" = "backend"
        }
      + tags_all                    = {
          + "Component"   = "backend"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ot-muse"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3.aws_s3_bucket_cors_configuration.assets will be created
  + resource "aws_s3_bucket_cors_configuration" "assets" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "PUT",
            ]
          + allowed_origins = [
              + "http://localhost:3000",
              + "https://main.d23iuljt6mvkva.amplifyapp.com",
            ]
          + expose_headers  = [
              + "ETag",
            ]
            id              = null
          + max_age_seconds = 3600
        }
    }

  # module.s3.aws_s3_bucket_public_access_block.assets will be created
  + resource "aws_s3_bucket_public_access_block" "assets" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3.aws_s3_bucket_server_side_encryption_configuration.assets will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "assets" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.s3.aws_s3_bucket_versioning.assets will be created
  + resource "aws_s3_bucket_versioning" "assets" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

*Pushed by: @OnTrak-Tech*